app/Views/student/student_home.php

SELECT *
FROM `teacher_announcements`
WHERE `teacher_section` = 'TEACHER'
AND `teacher_grade` = '3'
ORDER BY `ta_id` DESC
 LIMIT 1
---
        <?php
            $teacher_announcment_builder = db_connect()->table('teacher_announcements');
            $teacher_announcment_builder->orderBy('ta_id','DESC');
            $teacher_announcment_query = $teacher_announcment_builder->getWhere(['teacher_section' => $session->get('section'), 'teacher_grade' => $session->get('grade')],1);