app/Views/student/student_activity.php

SELECT *
FROM `actvities`
WHERE `grade` = '3'
AND `section` = 'TEACHER'
---
            <tbody>
              <?php
                   $activity_builder= db_connect()->table('actvities');
                   $activity_results = $activity_builder->getWhere(['grade' => $session->get('grade'), 'section' => $session->get('section') ]);

SELECT *
FROM `scores`
WHERE `student_id` = '2'
AND `activity_id` = '6'
---
                  <div class="buttons">
                      <?php
                        $actvity_verification = db_connect()->table('scores');
                        $ver =  $actvity_verification->getWhere(['student_id'=>$session->get('user_id'),'activity_id' =>$activityRow->activity_id]);