app/Views/student/student_do_activity.php

SELECT *
FROM `scores`
WHERE `student_id` = '2'
AND `activity_id` = '10'
---
      }

      $actvity_verification = db_connect()->table('scores');
      $ver =  $actvity_verification->getWhere(['student_id'=>$session->get('user_id'),'activity_id' => $_SESSION['act_id']]);