app/Views/teacher/teacher_activities.php

SELECT *
FROM `actvities`
WHERE `grade` = '3'
AND `section` = 'TEACHER'
---
            <tbody>
              <?php
                   $activity_builder= db_connect()->table('actvities');
                   $activity_results = $activity_builder->getWhere(['grade' => $session->get('grade'), 'section' => $session->get('section') ]);