app/Views/teacher/teacher_activity_results.php

SELECT *
FROM `scores`
INNER JOIN `users` ON `users`.`user_id` = `scores`.`student_id`
WHERE `scores`.`activity_id` = '5'
AND `scores`.`teacher_id` = '3'
AND `users`.`user_type` = 'STUDENT'
AND `users`.`section` = 'TEACHER'
AND `users`.`grade` = '3'
---
                   $activity_builder= db_connect()->table('scores');
                   $activity_builder->select('*');
                   $activity_builder->join('users','users.user_id = scores.student_id','inner');
                   $activity_results = $activity_builder->getWhere(['scores.activity_id' => $_SESSION['activity_id'],'scores.teacher_id' => session()->get('user_id'),'users.user_type' => 'STUDENT','users.section' => $session->get('section'),'users.grade'=>$session->get('grade')]);