app/Views/teacher/teacher_manage_students.php

SELECT *
FROM `users`
WHERE `user_type` = 'STUDENT'
AND `grade` = '3'
AND `section` = 'TEACHER'
---
            <tbody>
                <?php
                  $users_builder= db_connect()->table('users');
                  $user_results = $users_builder->getWhere(['user_type'=>'STUDENT','grade' => $session->get('grade'),'section'=> $session->get('section')]);

SELECT *
FROM `users`
WHERE `user_type` = 'STUDENT'
AND `grade` = 0
AND `section` = 'TBA'
---
            <tbody>
                <?php
                  $users_builder= db_connect()->table('users');
                  $user_results = $users_builder->getWhere(['user_type'=>'STUDENT','grade' => 0,'section'=> 'TBA']);