app/Views/teacher/teacher_home.php

            <tbody>
              <?php
                   $announcement_builder= db_connect()->table('teacher_announcements');
                   $announcement_results = $announcement_builder->getWhere(['teacher_id' => $session->get('user_id')]);
---
SELECT *
FROM `teacher_announcements`
WHERE `teacher_id` = '3'