app/Views/admin/admin_students.php

SELECT *
FROM `users`
WHERE `user_type` = 'STUDENT'
---
                      <tbody>
                          <?php
                            $users_builder= db_connect()->table('users');
                            $user_results = $users_builder->getWhere(['user_type'=>'STUDENT']);