app/Views/admin/admin_users.php

SELECT *
FROM `users`
---
            <tbody>
                <?php
                  $users_builder= db_connect()->table('users');
                  $user_results = $users_builder->get();