app/Views/admin/admin_teachers.php

SELECT *
FROM `users`
WHERE `user_type` = 'TEACHER'
---
                      <tbody>
                          <?php
                            $users_builder= db_connect()->table('users');
                            $user_results = $users_builder->getWhere(['user_type'=>'TEACHER']);