app/Views/admin/admin_administrators.php

                      <tbody>
                          <?php
                            $users_builder= db_connect()->table('users');
                            $user_results = $users_builder->getWhere(['user_type'=>'ADMIN']);
---
SELECT *
FROM `users`
WHERE `user_type` = 'ADMIN'